areiter128/USB-PD-BoB/h/mcal/config/10889_P33CH_R10_pinmap.h
#if defined (__P33SMPS_CH_MSTR__)

// Device Pin #8 is RD15
	#define DBGLED_TRIS    TRISDbits.TRISD15 // GPIO direction register bit
	#define DBGLED_WR      LATDbits.LATD15 // GPIO port latch register bit
	#define DBGLED_RD      PORTDbits.RD15 // GPIO port register bit
	#define DBGLED_ODC     ODCDbits.ODCD15 // GPIO port open drain configuration register bit
	#define DBGLED_CNPU    CNPUDbits.CNPUD15 // GPIO port pull-up resistor register bit
	#define DBGLED_CNPD    CNPDDbits.CNPDD15 // GPIO port pull-down resistor register bit
	#define DBGLED_CNEN0   CNEN0Dbits.CNEN0D15 // GPIO port change notification Enable register bit
	#define DBGLED_CNSTAT  CNSTATDbits.CNSTATD15 // GPIO port change notification Status register bit
	#define DBGLED_CNEN1   CNEN1Dbits.CNEN1D15 // GPIO port change notification Edge Select Enable register bit
	#define DBGLED_CNF     CNFDbits.CNFD15 // GPIO port change notification flag bit register bit
	#define DBGLED_SET     { asm volatile ("bset _LATD, #15 \n"); }
	#define DBGLED_CLEAR   { asm volatile ("bclr _LATD, #15 \n"); }
	#define DBGLED_TOGGLE  { asm volatile ("btg  _LATD, #15 \n"); }
	#define DBGLED_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define DBGLED_INIT_OUTPUT  {DBGLED_WR = PINSTATE_LOW; DBGLED_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define DBGLED_INIT_INPUT   {DBGLED_WR = PINSTATE_HIGH; DBGLED_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #12 is RD13
	#define DBGPIN_TRIS    TRISDbits.TRISD13 // GPIO direction register bit
	#define DBGPIN_WR      LATDbits.LATD13 // GPIO port latch register bit
	#define DBGPIN_RD      PORTDbits.RD13 // GPIO port register bit
	#define DBGPIN_ODC     ODCDbits.ODCD13 // GPIO port open drain configuration register bit
	#define DBGPIN_CNPU    CNPUDbits.CNPUD13 // GPIO port pull-up resistor register bit
	#define DBGPIN_CNPD    CNPDDbits.CNPDD13 // GPIO port pull-down resistor register bit
	#define DBGPIN_CNEN0   CNEN0Dbits.CNEN0D13 // GPIO port change notification Enable register bit
	#define DBGPIN_CNSTAT  CNSTATDbits.CNSTATD13 // GPIO port change notification Status register bit
	#define DBGPIN_CNEN1   CNEN1Dbits.CNEN1D13 // GPIO port change notification Edge Select Enable register bit
	#define DBGPIN_CNF     CNFDbits.CNFD13 // GPIO port change notification flag bit register bit
	#define DBGPIN_SET     { asm volatile ("bset _LATD, #13 \n"); }
	#define DBGPIN_CLEAR   { asm volatile ("bclr _LATD, #13 \n"); }
	#define DBGPIN_TOGGLE  { asm volatile ("btg  _LATD, #13 \n"); }
	#define DBGPIN_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define DBGPIN_INIT_OUTPUT  {DBGPIN_WR = PINSTATE_LOW; DBGPIN_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define DBGPIN_INIT_INPUT   {DBGPIN_WR = PINSTATE_HIGH; DBGPIN_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #33 is RB2
	#define ECP03_TRIS    TRISBbits.TRISB2 // GPIO direction register bit
	#define ECP03_WR      LATBbits.LATB2 // GPIO port latch register bit
	#define ECP03_RD      PORTBbits.RB2 // GPIO port register bit
	#define ECP03_ODC     ODCBbits.ODCB2 // GPIO port open drain configuration register bit
	#define ECP03_CNPU    CNPUBbits.CNPUB2 // GPIO port pull-up resistor register bit
	#define ECP03_CNPD    CNPDBbits.CNPDB2 // GPIO port pull-down resistor register bit
	#define ECP03_CNEN0   CNEN0Bbits.CNEN0B2 // GPIO port change notification Enable register bit
	#define ECP03_CNSTAT  CNSTATBbits.CNSTATB2 // GPIO port change notification Status register bit
	#define ECP03_CNEN1   CNEN1Bbits.CNEN1B2 // GPIO port change notification Edge Select Enable register bit
	#define ECP03_CNF     CNFBbits.CNFB2 // GPIO port change notification flag bit register bit
	#define ECP03_RP      34 // Number of Remappable Pin
	#define ECP03_SET     { asm volatile ("bset _LATB, #2 \n"); }
	#define ECP03_CLEAR   { asm volatile ("bclr _LATB, #2 \n"); }
	#define ECP03_TOGGLE  { asm volatile ("btg  _LATB, #2 \n"); }
	#define ECP03_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP03_ANSEL   _ANSELB2 // analog/digital pin configuration register bit
	#define ECP03_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP03_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP03_ADC_AN_INPUT 7   // ANx input pin number
	#define ECP03_ADCBUF  ADCBUF7 // ADC buffer register for this input
	#define ECP03_ADC_ANIE ADIELbits.IE7
	#define ECP03_ADC_ANEIE ADEIELbits.EIEN7
	#define ECP03_ADC_IF   _ADCAN7IF // interrupt flag bit
	#define ECP03_ADC_IE   _ADCAN7IE // interrupt enable bit
	#define ECP03_ADC_IP   _ADCAN7IP // interrupt priority for this analog input
	#define ECP03_ADC_RDY  _AN7RDY // ADC buffer ready bit
	#define _ECP03_ADC_Interrupt _ADCAN7Interrupt
	#define ECP03_INIT_ANALOG	{ECP03_ANSEL = 1; ECP03_WR = PINSTATE_HIGH; ECP03_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP03_INIT_OUTPUT  {ECP03_WR = PINSTATE_LOW; ECP03_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP03_INIT_INPUT   {ECP03_WR = PINSTATE_HIGH; ECP03_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #32 is RC7
	#define ECP04_TRIS    TRISCbits.TRISC7 // GPIO direction register bit
	#define ECP04_WR      LATCbits.LATC7 // GPIO port latch register bit
	#define ECP04_RD      PORTCbits.RC7 // GPIO port register bit
	#define ECP04_ODC     ODCCbits.ODCC7 // GPIO port open drain configuration register bit
	#define ECP04_CNPU    CNPUCbits.CNPUC7 // GPIO port pull-up resistor register bit
	#define ECP04_CNPD    CNPDCbits.CNPDC7 // GPIO port pull-down resistor register bit
	#define ECP04_CNEN0   CNEN0Cbits.CNEN0C7 // GPIO port change notification Enable register bit
	#define ECP04_CNSTAT  CNSTATCbits.CNSTATC7 // GPIO port change notification Status register bit
	#define ECP04_CNEN1   CNEN1Cbits.CNEN1C7 // GPIO port change notification Edge Select Enable register bit
	#define ECP04_CNF     CNFCbits.CNFC7 // GPIO port change notification flag bit register bit
	#define ECP04_RP      55 // Number of Remappable Pin
	#define ECP04_SET     { asm volatile ("bset _LATC, #7 \n"); }
	#define ECP04_CLEAR   { asm volatile ("bclr _LATC, #7 \n"); }
	#define ECP04_TOGGLE  { asm volatile ("btg  _LATC, #7 \n"); }
	#define ECP04_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP04_INIT_OUTPUT  {ECP04_WR = PINSTATE_LOW; ECP04_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP04_INIT_INPUT   {ECP04_WR = PINSTATE_HIGH; ECP04_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
