areiter128/USB-PD-BoB/h/mcal/config/10889_P33CH_R10_pinmap.h
// Device Pin #31 is RD10
	#define ECP16_TRIS    TRISDbits.TRISD10 // GPIO direction register bit
	#define ECP16_WR      LATDbits.LATD10 // GPIO port latch register bit
	#define ECP16_RD      PORTDbits.RD10 // GPIO port register bit
	#define ECP16_ODC     ODCDbits.ODCD10 // GPIO port open drain configuration register bit
	#define ECP16_CNPU    CNPUDbits.CNPUD10 // GPIO port pull-up resistor register bit
	#define ECP16_CNPD    CNPDDbits.CNPDD10 // GPIO port pull-down resistor register bit
	#define ECP16_CNEN0   CNEN0Dbits.CNEN0D10 // GPIO port change notification Enable register bit
	#define ECP16_CNSTAT  CNSTATDbits.CNSTATD10 // GPIO port change notification Status register bit
	#define ECP16_CNEN1   CNEN1Dbits.CNEN1D10 // GPIO port change notification Edge Select Enable register bit
	#define ECP16_CNF     CNFDbits.CNFD10 // GPIO port change notification flag bit register bit
	#define ECP16_SET     { asm volatile ("bset _LATD, #10 \n"); }
	#define ECP16_CLEAR   { asm volatile ("bclr _LATD, #10 \n"); }
	#define ECP16_TOGGLE  { asm volatile ("btg  _LATD, #10 \n"); }
	#define ECP16_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP16_INIT_OUTPUT  {ECP16_WR = PINSTATE_LOW; ECP16_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP16_INIT_INPUT   {ECP16_WR = PINSTATE_HIGH; ECP16_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #21 is RD12
	#define ECP17_TRIS    TRISDbits.TRISD12 // GPIO direction register bit
	#define ECP17_WR      LATDbits.LATD12 // GPIO port latch register bit
	#define ECP17_RD      PORTDbits.RD12 // GPIO port register bit
	#define ECP17_ODC     ODCDbits.ODCD12 // GPIO port open drain configuration register bit
	#define ECP17_CNPU    CNPUDbits.CNPUD12 // GPIO port pull-up resistor register bit
	#define ECP17_CNPD    CNPDDbits.CNPDD12 // GPIO port pull-down resistor register bit
	#define ECP17_CNEN0   CNEN0Dbits.CNEN0D12 // GPIO port change notification Enable register bit
	#define ECP17_CNSTAT  CNSTATDbits.CNSTATD12 // GPIO port change notification Status register bit
	#define ECP17_CNEN1   CNEN1Dbits.CNEN1D12 // GPIO port change notification Edge Select Enable register bit
	#define ECP17_CNF     CNFDbits.CNFD12 // GPIO port change notification flag bit register bit
	#define ECP17_SET     { asm volatile ("bset _LATD, #12 \n"); }
	#define ECP17_CLEAR   { asm volatile ("bclr _LATD, #12 \n"); }
	#define ECP17_TOGGLE  { asm volatile ("btg  _LATD, #12 \n"); }
	#define ECP17_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP17_INIT_OUTPUT  {ECP17_WR = PINSTATE_LOW; ECP17_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP17_INIT_INPUT   {ECP17_WR = PINSTATE_HIGH; ECP17_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #24 is RC6
	#define ECP18_TRIS    TRISCbits.TRISC6 // GPIO direction register bit
	#define ECP18_WR      LATCbits.LATC6 // GPIO port latch register bit
	#define ECP18_RD      PORTCbits.RC6 // GPIO port register bit
	#define ECP18_ODC     ODCCbits.ODCC6 // GPIO port open drain configuration register bit
	#define ECP18_CNPU    CNPUCbits.CNPUC6 // GPIO port pull-up resistor register bit
	#define ECP18_CNPD    CNPDCbits.CNPDC6 // GPIO port pull-down resistor register bit
	#define ECP18_CNEN0   CNEN0Cbits.CNEN0C6 // GPIO port change notification Enable register bit
	#define ECP18_CNSTAT  CNSTATCbits.CNSTATC6 // GPIO port change notification Status register bit
	#define ECP18_CNEN1   CNEN1Cbits.CNEN1C6 // GPIO port change notification Edge Select Enable register bit
	#define ECP18_CNF     CNFCbits.CNFC6 // GPIO port change notification flag bit register bit
	#define ECP18_RP      54 // Number of Remappable Pin
	#define ECP18_SET     { asm volatile ("bset _LATC, #6 \n"); }
	#define ECP18_CLEAR   { asm volatile ("bclr _LATC, #6 \n"); }
	#define ECP18_TOGGLE  { asm volatile ("btg  _LATC, #6 \n"); }
	#define ECP18_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP18_INIT_OUTPUT  {ECP18_WR = PINSTATE_LOW; ECP18_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP18_INIT_INPUT   {ECP18_WR = PINSTATE_HIGH; ECP18_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #29 is RB1
	#define ECP20_TRIS    TRISBbits.TRISB1 // GPIO direction register bit
	#define ECP20_WR      LATBbits.LATB1 // GPIO port latch register bit
	#define ECP20_RD      PORTBbits.RB1 // GPIO port register bit
	#define ECP20_ODC     ODCBbits.ODCB1 // GPIO port open drain configuration register bit
	#define ECP20_CNPU    CNPUBbits.CNPUB1 // GPIO port pull-up resistor register bit
	#define ECP20_CNPD    CNPDBbits.CNPDB1 // GPIO port pull-down resistor register bit
	#define ECP20_CNEN0   CNEN0Bbits.CNEN0B1 // GPIO port change notification Enable register bit
	#define ECP20_CNSTAT  CNSTATBbits.CNSTATB1 // GPIO port change notification Status register bit
	#define ECP20_CNEN1   CNEN1Bbits.CNEN1B1 // GPIO port change notification Edge Select Enable register bit
	#define ECP20_CNF     CNFBbits.CNFB1 // GPIO port change notification flag bit register bit
	#define ECP20_RP      33 // Number of Remappable Pin
	#define ECP20_SET     { asm volatile ("bset _LATB, #1 \n"); }
	#define ECP20_CLEAR   { asm volatile ("bclr _LATB, #1 \n"); }
	#define ECP20_TOGGLE  { asm volatile ("btg  _LATB, #1 \n"); }
	#define ECP20_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP20_ANSEL   _ANSELB1 // analog/digital pin configuration register bit
	#define ECP20_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define ECP20_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP20_ADC_AN_INPUT 6   // ANx input pin number
	#define ECP20_ADCBUF  ADCBUF6 // ADC buffer register for this input
	#define ECP20_ADC_ANIE ADIELbits.IE6
	#define ECP20_ADC_ANEIE ADEIELbits.EIEN6
	#define ECP20_ADC_IF   _ADCAN6IF // interrupt flag bit
	#define ECP20_ADC_IE   _ADCAN6IE // interrupt enable bit
	#define ECP20_ADC_IP   _ADCAN6IP // interrupt priority for this analog input
	#define ECP20_ADC_RDY  _AN6RDY // ADC buffer ready bit
	#define _ECP20_ADC_Interrupt _ADCAN6Interrupt
	#define ECP20_INIT_ANALOG	{ECP20_ANSEL = 1; ECP20_WR = PINSTATE_HIGH; ECP20_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP20_INIT_OUTPUT  {ECP20_WR = PINSTATE_LOW; ECP20_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP20_INIT_INPUT   {ECP20_WR = PINSTATE_HIGH; ECP20_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
