areiter128/USB-PD-BoB/h/mcal/config/10889_P33CH_R10_pinmap.h
// Device Pin #37 is RC9
	#define ECP32_TRIS    TRISCbits.TRISC9 // GPIO direction register bit
	#define ECP32_WR      LATCbits.LATC9 // GPIO port latch register bit
	#define ECP32_RD      PORTCbits.RC9 // GPIO port register bit
	#define ECP32_ODC     ODCCbits.ODCC9 // GPIO port open drain configuration register bit
	#define ECP32_CNPU    CNPUCbits.CNPUC9 // GPIO port pull-up resistor register bit
	#define ECP32_CNPD    CNPDCbits.CNPDC9 // GPIO port pull-down resistor register bit
	#define ECP32_CNEN0   CNEN0Cbits.CNEN0C9 // GPIO port change notification Enable register bit
	#define ECP32_CNSTAT  CNSTATCbits.CNSTATC9 // GPIO port change notification Status register bit
	#define ECP32_CNEN1   CNEN1Cbits.CNEN1C9 // GPIO port change notification Edge Select Enable register bit
	#define ECP32_CNF     CNFCbits.CNFC9 // GPIO port change notification flag bit register bit
	#define ECP32_RP      57 // Number of Remappable Pin
	#define ECP32_SET     { asm volatile ("bset _LATC, #9 \n"); }
	#define ECP32_CLEAR   { asm volatile ("bclr _LATC, #9 \n"); }
	#define ECP32_TOGGLE  { asm volatile ("btg  _LATC, #9 \n"); }
	#define ECP32_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP32_INIT_OUTPUT  {ECP32_WR = PINSTATE_LOW; ECP32_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP32_INIT_INPUT   {ECP32_WR = PINSTATE_HIGH; ECP32_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #44 is RD5
	#define ECP33_TRIS    TRISDbits.TRISD5 // GPIO direction register bit
	#define ECP33_WR      LATDbits.LATD5 // GPIO port latch register bit
	#define ECP33_RD      PORTDbits.RD5 // GPIO port register bit
	#define ECP33_ODC     ODCDbits.ODCD5 // GPIO port open drain configuration register bit
	#define ECP33_CNPU    CNPUDbits.CNPUD5 // GPIO port pull-up resistor register bit
	#define ECP33_CNPD    CNPDDbits.CNPDD5 // GPIO port pull-down resistor register bit
	#define ECP33_CNEN0   CNEN0Dbits.CNEN0D5 // GPIO port change notification Enable register bit
	#define ECP33_CNSTAT  CNSTATDbits.CNSTATD5 // GPIO port change notification Status register bit
	#define ECP33_CNEN1   CNEN1Dbits.CNEN1D5 // GPIO port change notification Edge Select Enable register bit
	#define ECP33_CNF     CNFDbits.CNFD5 // GPIO port change notification flag bit register bit
	#define ECP33_RP      69 // Number of Remappable Pin
	#define ECP33_SET     { asm volatile ("bset _LATD, #5 \n"); }
	#define ECP33_CLEAR   { asm volatile ("bclr _LATD, #5 \n"); }
	#define ECP33_TOGGLE  { asm volatile ("btg  _LATD, #5 \n"); }
	#define ECP33_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP33_INIT_OUTPUT  {ECP33_WR = PINSTATE_LOW; ECP33_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP33_INIT_INPUT   {ECP33_WR = PINSTATE_HIGH; ECP33_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #62 is RB11
	#define ECP34_TRIS    TRISBbits.TRISB11 // GPIO direction register bit
	#define ECP34_WR      LATBbits.LATB11 // GPIO port latch register bit
	#define ECP34_RD      PORTBbits.RB11 // GPIO port register bit
	#define ECP34_ODC     ODCBbits.ODCB11 // GPIO port open drain configuration register bit
	#define ECP34_CNPU    CNPUBbits.CNPUB11 // GPIO port pull-up resistor register bit
	#define ECP34_CNPD    CNPDBbits.CNPDB11 // GPIO port pull-down resistor register bit
	#define ECP34_CNEN0   CNEN0Bbits.CNEN0B11 // GPIO port change notification Enable register bit
	#define ECP34_CNSTAT  CNSTATBbits.CNSTATB11 // GPIO port change notification Status register bit
	#define ECP34_CNEN1   CNEN1Bbits.CNEN1B11 // GPIO port change notification Edge Select Enable register bit
	#define ECP34_CNF     CNFBbits.CNFB11 // GPIO port change notification flag bit register bit
	#define ECP34_RP      43 // Number of Remappable Pin
	#define ECP34_SET     { asm volatile ("bset _LATB, #11 \n"); }
	#define ECP34_CLEAR   { asm volatile ("bclr _LATB, #11 \n"); }
	#define ECP34_TOGGLE  { asm volatile ("btg  _LATB, #11 \n"); }
	#define ECP34_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP34_INIT_OUTPUT  {ECP34_WR = PINSTATE_LOW; ECP34_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP34_INIT_INPUT   {ECP34_WR = PINSTATE_HIGH; ECP34_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP34_PGx_CHANNEL  3 // PWM channel index
	#define ECP34_PGx_PER      PG3PER // PWM channel period register
	#define ECP34_PGx_PHASE    PG3PHASE // PWM channel phase register
	#define ECP34_PGx_DC       PG3DC // PWM channel duty cycle register
	#define ECP34_PGx_OVRENL   PG3IOCONLbits.OVRENL // PWM channel IO config register override low control bit
	#define ECP34_PGx_PENL     PG3IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
	#define ECP34_PGxUPDREQ    PG3STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP34_PGxTRIGA     PG3TRIGA // PWM channel ADC trigger A register
	#define ECP34_PGxTRIGB     PG3TRIGB // PWM channel ADC trigger A register
	#define ECP34_PGxTRIGC     PG3TRIGC // PWM channel ADC trigger A register
	
// Device Pin #1 is RB14
	#define ECP35_TRIS    TRISBbits.TRISB14 // GPIO direction register bit
	#define ECP35_WR      LATBbits.LATB14 // GPIO port latch register bit
	#define ECP35_RD      PORTBbits.RB14 // GPIO port register bit
	#define ECP35_ODC     ODCBbits.ODCB14 // GPIO port open drain configuration register bit
	#define ECP35_CNPU    CNPUBbits.CNPUB14 // GPIO port pull-up resistor register bit
	#define ECP35_CNPD    CNPDBbits.CNPDB14 // GPIO port pull-down resistor register bit
	#define ECP35_CNEN0   CNEN0Bbits.CNEN0B14 // GPIO port change notification Enable register bit
	#define ECP35_CNSTAT  CNSTATBbits.CNSTATB14 // GPIO port change notification Status register bit
	#define ECP35_CNEN1   CNEN1Bbits.CNEN1B14 // GPIO port change notification Edge Select Enable register bit
	#define ECP35_CNF     CNFBbits.CNFB14 // GPIO port change notification flag bit register bit
	#define ECP35_RP      46 // Number of Remappable Pin
	#define ECP35_SET     { asm volatile ("bset _LATB, #14 \n"); }
	#define ECP35_CLEAR   { asm volatile ("bclr _LATB, #14 \n"); }
	#define ECP35_TOGGLE  { asm volatile ("btg  _LATB, #14 \n"); }
	#define ECP35_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP35_INIT_OUTPUT  {ECP35_WR = PINSTATE_LOW; ECP35_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP35_INIT_INPUT   {ECP35_WR = PINSTATE_HIGH; ECP35_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP35_PGx_CHANNEL  1 // PWM channel index
	#define ECP35_PGx_PER      PG1PER // PWM channel period register
	#define ECP35_PGx_PHASE    PG1PHASE // PWM channel phase register
	#define ECP35_PGx_DC       PG1DC // PWM channel duty cycle register
	#define ECP35_PGx_OVRENH   PG1IOCONLbits.OVRENH // PWM channel IO config register override high control bit
	#define ECP35_PGx_PENH     PG1IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
	#define ECP35_PGxUPDREQ    PG1STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP35_PGxTRIGA     PG1TRIGA // PWM channel ADC trigger A register
	#define ECP35_PGxTRIGB     PG1TRIGB // PWM channel ADC trigger A register
	#define ECP35_PGxTRIGC     PG1TRIGC // PWM channel ADC trigger A register
	
// Device Pin #61 is RB10
	#define ECP36_TRIS    TRISBbits.TRISB10 // GPIO direction register bit
	#define ECP36_WR      LATBbits.LATB10 // GPIO port latch register bit
	#define ECP36_RD      PORTBbits.RB10 // GPIO port register bit
	#define ECP36_ODC     ODCBbits.ODCB10 // GPIO port open drain configuration register bit
	#define ECP36_CNPU    CNPUBbits.CNPUB10 // GPIO port pull-up resistor register bit
	#define ECP36_CNPD    CNPDBbits.CNPDB10 // GPIO port pull-down resistor register bit
	#define ECP36_CNEN0   CNEN0Bbits.CNEN0B10 // GPIO port change notification Enable register bit
	#define ECP36_CNSTAT  CNSTATBbits.CNSTATB10 // GPIO port change notification Status register bit
	#define ECP36_CNEN1   CNEN1Bbits.CNEN1B10 // GPIO port change notification Edge Select Enable register bit
	#define ECP36_CNF     CNFBbits.CNFB10 // GPIO port change notification flag bit register bit
	#define ECP36_RP      42 // Number of Remappable Pin
	#define ECP36_SET     { asm volatile ("bset _LATB, #10 \n"); }
	#define ECP36_CLEAR   { asm volatile ("bclr _LATB, #10 \n"); }
	#define ECP36_TOGGLE  { asm volatile ("btg  _LATB, #10 \n"); }
	#define ECP36_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP36_INIT_OUTPUT  {ECP36_WR = PINSTATE_LOW; ECP36_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP36_INIT_INPUT   {ECP36_WR = PINSTATE_HIGH; ECP36_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP36_PGx_CHANNEL  3 // PWM channel index
	#define ECP36_PGx_PER      PG3PER // PWM channel period register
	#define ECP36_PGx_PHASE    PG3PHASE // PWM channel phase register
	#define ECP36_PGx_DC       PG3DC // PWM channel duty cycle register
	#define ECP36_PGx_OVRENH   PG3IOCONLbits.OVRENH // PWM channel IO config register override high control bit
	#define ECP36_PGx_PENH     PG3IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
	#define ECP36_PGxUPDREQ    PG3STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP36_PGxTRIGA     PG3TRIGA // PWM channel ADC trigger A register
	#define ECP36_PGxTRIGB     PG3TRIGB // PWM channel ADC trigger A register
	#define ECP36_PGxTRIGC     PG3TRIGC // PWM channel ADC trigger A register
	
// Device Pin #54 is RD4
	#define ECP37_TRIS    TRISDbits.TRISD4 // GPIO direction register bit
	#define ECP37_WR      LATDbits.LATD4 // GPIO port latch register bit
	#define ECP37_RD      PORTDbits.RD4 // GPIO port register bit
	#define ECP37_ODC     ODCDbits.ODCD4 // GPIO port open drain configuration register bit
	#define ECP37_CNPU    CNPUDbits.CNPUD4 // GPIO port pull-up resistor register bit
	#define ECP37_CNPD    CNPDDbits.CNPDD4 // GPIO port pull-down resistor register bit
	#define ECP37_CNEN0   CNEN0Dbits.CNEN0D4 // GPIO port change notification Enable register bit
	#define ECP37_CNSTAT  CNSTATDbits.CNSTATD4 // GPIO port change notification Status register bit
	#define ECP37_CNEN1   CNEN1Dbits.CNEN1D4 // GPIO port change notification Edge Select Enable register bit
	#define ECP37_CNF     CNFDbits.CNFD4 // GPIO port change notification flag bit register bit
	#define ECP37_RP      68 // Number of Remappable Pin
	#define ECP37_SET     { asm volatile ("bset _LATD, #4 \n"); }
	#define ECP37_CLEAR   { asm volatile ("bclr _LATD, #4 \n"); }
	#define ECP37_TOGGLE  { asm volatile ("btg  _LATD, #4 \n"); }
	#define ECP37_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP37_INIT_OUTPUT  {ECP37_WR = PINSTATE_LOW; ECP37_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP37_INIT_INPUT   {ECP37_WR = PINSTATE_HIGH; ECP37_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #2 is RB15
	#define ECP38_TRIS    TRISBbits.TRISB15 // GPIO direction register bit
	#define ECP38_WR      LATBbits.LATB15 // GPIO port latch register bit
	#define ECP38_RD      PORTBbits.RB15 // GPIO port register bit
	#define ECP38_ODC     ODCBbits.ODCB15 // GPIO port open drain configuration register bit
	#define ECP38_CNPU    CNPUBbits.CNPUB15 // GPIO port pull-up resistor register bit
	#define ECP38_CNPD    CNPDBbits.CNPDB15 // GPIO port pull-down resistor register bit
	#define ECP38_CNEN0   CNEN0Bbits.CNEN0B15 // GPIO port change notification Enable register bit
	#define ECP38_CNSTAT  CNSTATBbits.CNSTATB15 // GPIO port change notification Status register bit
	#define ECP38_CNEN1   CNEN1Bbits.CNEN1B15 // GPIO port change notification Edge Select Enable register bit
	#define ECP38_CNF     CNFBbits.CNFB15 // GPIO port change notification flag bit register bit
	#define ECP38_RP      47 // Number of Remappable Pin
	#define ECP38_SET     { asm volatile ("bset _LATB, #15 \n"); }
	#define ECP38_CLEAR   { asm volatile ("bclr _LATB, #15 \n"); }
	#define ECP38_TOGGLE  { asm volatile ("btg  _LATB, #15 \n"); }
	#define ECP38_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP38_INIT_OUTPUT  {ECP38_WR = PINSTATE_LOW; ECP38_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP38_INIT_INPUT   {ECP38_WR = PINSTATE_HIGH; ECP38_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	#define ECP38_PGx_CHANNEL  1 // PWM channel index
	#define ECP38_PGx_PER      PG1PER // PWM channel period register
	#define ECP38_PGx_PHASE    PG1PHASE // PWM channel phase register
	#define ECP38_PGx_DC       PG1DC // PWM channel duty cycle register
	#define ECP38_PGx_OVRENL   PG1IOCONLbits.OVRENL // PWM channel IO config register override low control bit
	#define ECP38_PGx_PENL     PG1IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
	#define ECP38_PGxUPDREQ    PG1STATbits.UPDREQ // PWM channel ADC trigger A register
	#define ECP38_PGxTRIGA     PG1TRIGA // PWM channel ADC trigger A register
	#define ECP38_PGxTRIGB     PG1TRIGB // PWM channel ADC trigger A register
	#define ECP38_PGxTRIGC     PG1TRIGC // PWM channel ADC trigger A register
	
// Device Pin #58 is RD2
	#define ECP39_TRIS    TRISDbits.TRISD2 // GPIO direction register bit
	#define ECP39_WR      LATDbits.LATD2 // GPIO port latch register bit
	#define ECP39_RD      PORTDbits.RD2 // GPIO port register bit
	#define ECP39_ODC     ODCDbits.ODCD2 // GPIO port open drain configuration register bit
	#define ECP39_CNPU    CNPUDbits.CNPUD2 // GPIO port pull-up resistor register bit
	#define ECP39_CNPD    CNPDDbits.CNPDD2 // GPIO port pull-down resistor register bit
	#define ECP39_CNEN0   CNEN0Dbits.CNEN0D2 // GPIO port change notification Enable register bit
	#define ECP39_CNSTAT  CNSTATDbits.CNSTATD2 // GPIO port change notification Status register bit
	#define ECP39_CNEN1   CNEN1Dbits.CNEN1D2 // GPIO port change notification Edge Select Enable register bit
	#define ECP39_CNF     CNFDbits.CNFD2 // GPIO port change notification flag bit register bit
	#define ECP39_RP      66 // Number of Remappable Pin
	#define ECP39_SET     { asm volatile ("bset _LATD, #2 \n"); }
	#define ECP39_CLEAR   { asm volatile ("bclr _LATD, #2 \n"); }
	#define ECP39_TOGGLE  { asm volatile ("btg  _LATD, #2 \n"); }
	#define ECP39_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP39_INIT_OUTPUT  {ECP39_WR = PINSTATE_LOW; ECP39_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP39_INIT_INPUT   {ECP39_WR = PINSTATE_HIGH; ECP39_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #51 is RC5
	#define ECP40_TRIS    TRISCbits.TRISC5 // GPIO direction register bit
	#define ECP40_WR      LATCbits.LATC5 // GPIO port latch register bit
	#define ECP40_RD      PORTCbits.RC5 // GPIO port register bit
	#define ECP40_ODC     ODCCbits.ODCC5 // GPIO port open drain configuration register bit
	#define ECP40_CNPU    CNPUCbits.CNPUC5 // GPIO port pull-up resistor register bit
	#define ECP40_CNPD    CNPDCbits.CNPDC5 // GPIO port pull-down resistor register bit
	#define ECP40_CNEN0   CNEN0Cbits.CNEN0C5 // GPIO port change notification Enable register bit
	#define ECP40_CNSTAT  CNSTATCbits.CNSTATC5 // GPIO port change notification Status register bit
	#define ECP40_CNEN1   CNEN1Cbits.CNEN1C5 // GPIO port change notification Edge Select Enable register bit
	#define ECP40_CNF     CNFCbits.CNFC5 // GPIO port change notification flag bit register bit
	#define ECP40_RP      53 // Number of Remappable Pin
	#define ECP40_SET     { asm volatile ("bset _LATC, #5 \n"); }
	#define ECP40_CLEAR   { asm volatile ("bclr _LATC, #5 \n"); }
	#define ECP40_TOGGLE  { asm volatile ("btg  _LATC, #5 \n"); }
	#define ECP40_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP40_INIT_OUTPUT  {ECP40_WR = PINSTATE_LOW; ECP40_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP40_INIT_INPUT   {ECP40_WR = PINSTATE_HIGH; ECP40_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #55 is RD3
	#define ECP41_TRIS    TRISDbits.TRISD3 // GPIO direction register bit
	#define ECP41_WR      LATDbits.LATD3 // GPIO port latch register bit
	#define ECP41_RD      PORTDbits.RD3 // GPIO port register bit
	#define ECP41_ODC     ODCDbits.ODCD3 // GPIO port open drain configuration register bit
	#define ECP41_CNPU    CNPUDbits.CNPUD3 // GPIO port pull-up resistor register bit
	#define ECP41_CNPD    CNPDDbits.CNPDD3 // GPIO port pull-down resistor register bit
	#define ECP41_CNEN0   CNEN0Dbits.CNEN0D3 // GPIO port change notification Enable register bit
	#define ECP41_CNSTAT  CNSTATDbits.CNSTATD3 // GPIO port change notification Status register bit
	#define ECP41_CNEN1   CNEN1Dbits.CNEN1D3 // GPIO port change notification Edge Select Enable register bit
	#define ECP41_CNF     CNFDbits.CNFD3 // GPIO port change notification flag bit register bit
	#define ECP41_RP      67 // Number of Remappable Pin
	#define ECP41_SET     { asm volatile ("bset _LATD, #3 \n"); }
	#define ECP41_CLEAR   { asm volatile ("bclr _LATD, #3 \n"); }
	#define ECP41_TOGGLE  { asm volatile ("btg  _LATD, #3 \n"); }
	#define ECP41_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP41_INIT_OUTPUT  {ECP41_WR = PINSTATE_LOW; ECP41_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP41_INIT_INPUT   {ECP41_WR = PINSTATE_HIGH; ECP41_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #50 is RC4
	#define ECP42_TRIS    TRISCbits.TRISC4 // GPIO direction register bit
	#define ECP42_WR      LATCbits.LATC4 // GPIO port latch register bit
	#define ECP42_RD      PORTCbits.RC4 // GPIO port register bit
	#define ECP42_ODC     ODCCbits.ODCC4 // GPIO port open drain configuration register bit
	#define ECP42_CNPU    CNPUCbits.CNPUC4 // GPIO port pull-up resistor register bit
	#define ECP42_CNPD    CNPDCbits.CNPDC4 // GPIO port pull-down resistor register bit
	#define ECP42_CNEN0   CNEN0Cbits.CNEN0C4 // GPIO port change notification Enable register bit
	#define ECP42_CNSTAT  CNSTATCbits.CNSTATC4 // GPIO port change notification Status register bit
	#define ECP42_CNEN1   CNEN1Cbits.CNEN1C4 // GPIO port change notification Edge Select Enable register bit
	#define ECP42_CNF     CNFCbits.CNFC4 // GPIO port change notification flag bit register bit
	#define ECP42_RP      52 // Number of Remappable Pin
	#define ECP42_SET     { asm volatile ("bset _LATC, #4 \n"); }
	#define ECP42_CLEAR   { asm volatile ("bclr _LATC, #4 \n"); }
	#define ECP42_TOGGLE  { asm volatile ("btg  _LATC, #4 \n"); }
	#define ECP42_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP42_INIT_OUTPUT  {ECP42_WR = PINSTATE_LOW; ECP42_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP42_INIT_INPUT   {ECP42_WR = PINSTATE_HIGH; ECP42_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #59 is RD1
	#define ECP43_TRIS    TRISDbits.TRISD1 // GPIO direction register bit
	#define ECP43_WR      LATDbits.LATD1 // GPIO port latch register bit
	#define ECP43_RD      PORTDbits.RD1 // GPIO port register bit
	#define ECP43_ODC     ODCDbits.ODCD1 // GPIO port open drain configuration register bit
	#define ECP43_CNPU    CNPUDbits.CNPUD1 // GPIO port pull-up resistor register bit
	#define ECP43_CNPD    CNPDDbits.CNPDD1 // GPIO port pull-down resistor register bit
	#define ECP43_CNEN0   CNEN0Dbits.CNEN0D1 // GPIO port change notification Enable register bit
	#define ECP43_CNSTAT  CNSTATDbits.CNSTATD1 // GPIO port change notification Status register bit
	#define ECP43_CNEN1   CNEN1Dbits.CNEN1D1 // GPIO port change notification Edge Select Enable register bit
	#define ECP43_CNF     CNFDbits.CNFD1 // GPIO port change notification flag bit register bit
	#define ECP43_RP      65 // Number of Remappable Pin
	#define ECP43_SET     { asm volatile ("bset _LATD, #1 \n"); }
	#define ECP43_CLEAR   { asm volatile ("bclr _LATD, #1 \n"); }
	#define ECP43_TOGGLE  { asm volatile ("btg  _LATD, #1 \n"); }
	#define ECP43_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP43_INIT_OUTPUT  {ECP43_WR = PINSTATE_LOW; ECP43_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP43_INIT_INPUT   {ECP43_WR = PINSTATE_HIGH; ECP43_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #60 is RD0
	#define ECP44_TRIS    TRISDbits.TRISD0 // GPIO direction register bit
	#define ECP44_WR      LATDbits.LATD0 // GPIO port latch register bit
	#define ECP44_RD      PORTDbits.RD0 // GPIO port register bit
	#define ECP44_ODC     ODCDbits.ODCD0 // GPIO port open drain configuration register bit
	#define ECP44_CNPU    CNPUDbits.CNPUD0 // GPIO port pull-up resistor register bit
	#define ECP44_CNPD    CNPDDbits.CNPDD0 // GPIO port pull-down resistor register bit
	#define ECP44_CNEN0   CNEN0Dbits.CNEN0D0 // GPIO port change notification Enable register bit
	#define ECP44_CNSTAT  CNSTATDbits.CNSTATD0 // GPIO port change notification Status register bit
	#define ECP44_CNEN1   CNEN1Dbits.CNEN1D0 // GPIO port change notification Edge Select Enable register bit
	#define ECP44_CNF     CNFDbits.CNFD0 // GPIO port change notification flag bit register bit
	#define ECP44_RP      64 // Number of Remappable Pin
	#define ECP44_SET     { asm volatile ("bset _LATD, #0 \n"); }
	#define ECP44_CLEAR   { asm volatile ("bclr _LATD, #0 \n"); }
	#define ECP44_TOGGLE  { asm volatile ("btg  _LATD, #0 \n"); }
	#define ECP44_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP44_INIT_OUTPUT  {ECP44_WR = PINSTATE_LOW; ECP44_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP44_INIT_INPUT   {ECP44_WR = PINSTATE_HIGH; ECP44_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #52 is RC10
	#define ECP45_TRIS    TRISCbits.TRISC10 // GPIO direction register bit
	#define ECP45_WR      LATCbits.LATC10 // GPIO port latch register bit
	#define ECP45_RD      PORTCbits.RC10 // GPIO port register bit
	#define ECP45_ODC     ODCCbits.ODCC10 // GPIO port open drain configuration register bit
	#define ECP45_CNPU    CNPUCbits.CNPUC10 // GPIO port pull-up resistor register bit
	#define ECP45_CNPD    CNPDCbits.CNPDC10 // GPIO port pull-down resistor register bit
	#define ECP45_CNEN0   CNEN0Cbits.CNEN0C10 // GPIO port change notification Enable register bit
	#define ECP45_CNSTAT  CNSTATCbits.CNSTATC10 // GPIO port change notification Status register bit
	#define ECP45_CNEN1   CNEN1Cbits.CNEN1C10 // GPIO port change notification Edge Select Enable register bit
	#define ECP45_CNF     CNFCbits.CNFC10 // GPIO port change notification flag bit register bit
	#define ECP45_RP      58 // Number of Remappable Pin
	#define ECP45_SET     { asm volatile ("bset _LATC, #10 \n"); }
	#define ECP45_CLEAR   { asm volatile ("bclr _LATC, #10 \n"); }
	#define ECP45_TOGGLE  { asm volatile ("btg  _LATC, #10 \n"); }
	#define ECP45_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP45_INIT_OUTPUT  {ECP45_WR = PINSTATE_LOW; ECP45_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP45_INIT_INPUT   {ECP45_WR = PINSTATE_HIGH; ECP45_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
