areiter128/USB-PD-BoB/h/mcal/config/10889_P33CH_R10_pinmap.h
// Device Pin #34 is RB3
	#define PGD_TRIS    TRISBbits.TRISB3 // GPIO direction register bit
	#define PGD_WR      LATBbits.LATB3 // GPIO port latch register bit
	#define PGD_RD      PORTBbits.RB3 // GPIO port register bit
	#define PGD_ODC     ODCBbits.ODCB3 // GPIO port open drain configuration register bit
	#define PGD_CNPU    CNPUBbits.CNPUB3 // GPIO port pull-up resistor register bit
	#define PGD_CNPD    CNPDBbits.CNPDB3 // GPIO port pull-down resistor register bit
	#define PGD_CNEN0   CNEN0Bbits.CNEN0B3 // GPIO port change notification Enable register bit
	#define PGD_CNSTAT  CNSTATBbits.CNSTATB3 // GPIO port change notification Status register bit
	#define PGD_CNEN1   CNEN1Bbits.CNEN1B3 // GPIO port change notification Edge Select Enable register bit
	#define PGD_CNF     CNFBbits.CNFB3 // GPIO port change notification flag bit register bit
	#define PGD_RP      35 // Number of Remappable Pin
	#define PGD_SET     { asm volatile ("bset _LATB, #3 \n"); }
	#define PGD_CLEAR   { asm volatile ("bclr _LATB, #3 \n"); }
	#define PGD_TOGGLE  { asm volatile ("btg  _LATB, #3 \n"); }
	#define PGD_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define PGD_ANSEL   _ANSELB3 // analog/digital pin configuration register bit
	#define PGD_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define PGD_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define PGD_ADC_AN_INPUT 8   // ANx input pin number
	#define PGD_ADCBUF  ADCBUF8 // ADC buffer register for this input
	#define PGD_ADC_ANIE ADIELbits.IE8
	#define PGD_ADC_ANEIE ADEIELbits.EIEN8
	#define PGD_ADC_IF   _ADCAN8IF // interrupt flag bit
	#define PGD_ADC_IE   _ADCAN8IE // interrupt enable bit
	#define PGD_ADC_IP   _ADCAN8IP // interrupt priority for this analog input
	#define PGD_ADC_RDY  _AN8RDY // ADC buffer ready bit
	#define _PGD_ADC_Interrupt _ADCAN8Interrupt
	#define PGD_INIT_ANALOG	{PGD_ANSEL = 1; PGD_WR = PINSTATE_HIGH; PGD_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define PGD_INIT_OUTPUT  {PGD_WR = PINSTATE_LOW; PGD_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define PGD_INIT_INPUT   {PGD_WR = PINSTATE_HIGH; PGD_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #46 is RB6
	#define SCL_TRIS    TRISBbits.TRISB6 // GPIO direction register bit
	#define SCL_WR      LATBbits.LATB6 // GPIO port latch register bit
	#define SCL_RD      PORTBbits.RB6 // GPIO port register bit
	#define SCL_ODC     ODCBbits.ODCB6 // GPIO port open drain configuration register bit
	#define SCL_CNPU    CNPUBbits.CNPUB6 // GPIO port pull-up resistor register bit
	#define SCL_CNPD    CNPDBbits.CNPDB6 // GPIO port pull-down resistor register bit
	#define SCL_CNEN0   CNEN0Bbits.CNEN0B6 // GPIO port change notification Enable register bit
	#define SCL_CNSTAT  CNSTATBbits.CNSTATB6 // GPIO port change notification Status register bit
	#define SCL_CNEN1   CNEN1Bbits.CNEN1B6 // GPIO port change notification Edge Select Enable register bit
	#define SCL_CNF     CNFBbits.CNFB6 // GPIO port change notification flag bit register bit
	#define SCL_RP      38 // Number of Remappable Pin
	#define SCL_SET     { asm volatile ("bset _LATB, #6 \n"); }
	#define SCL_CLEAR   { asm volatile ("bclr _LATB, #6 \n"); }
	#define SCL_TOGGLE  { asm volatile ("btg  _LATB, #6 \n"); }
	#define SCL_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define SCL_INIT_OUTPUT  {SCL_WR = PINSTATE_LOW; SCL_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define SCL_INIT_INPUT   {SCL_WR = PINSTATE_HIGH; SCL_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #45 is RB5
	#define SDA_TRIS    TRISBbits.TRISB5 // GPIO direction register bit
	#define SDA_WR      LATBbits.LATB5 // GPIO port latch register bit
	#define SDA_RD      PORTBbits.RB5 // GPIO port register bit
	#define SDA_ODC     ODCBbits.ODCB5 // GPIO port open drain configuration register bit
	#define SDA_CNPU    CNPUBbits.CNPUB5 // GPIO port pull-up resistor register bit
	#define SDA_CNPD    CNPDBbits.CNPDB5 // GPIO port pull-down resistor register bit
	#define SDA_CNEN0   CNEN0Bbits.CNEN0B5 // GPIO port change notification Enable register bit
	#define SDA_CNSTAT  CNSTATBbits.CNSTATB5 // GPIO port change notification Status register bit
	#define SDA_CNEN1   CNEN1Bbits.CNEN1B5 // GPIO port change notification Edge Select Enable register bit
	#define SDA_CNF     CNFBbits.CNFB5 // GPIO port change notification flag bit register bit
	#define SDA_RP      37 // Number of Remappable Pin
	#define SDA_SET     { asm volatile ("bset _LATB, #5 \n"); }
	#define SDA_CLEAR   { asm volatile ("bclr _LATB, #5 \n"); }
	#define SDA_TOGGLE  { asm volatile ("btg  _LATB, #5 \n"); }
	#define SDA_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define SDA_INIT_OUTPUT  {SDA_WR = PINSTATE_LOW; SDA_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define SDA_INIT_INPUT   {SDA_WR = PINSTATE_HIGH; SDA_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #6 is RC15
	#define UART_RX_TRIS    TRISCbits.TRISC15 // GPIO direction register bit
	#define UART_RX_WR      LATCbits.LATC15 // GPIO port latch register bit
	#define UART_RX_RD      PORTCbits.RC15 // GPIO port register bit
	#define UART_RX_ODC     ODCCbits.ODCC15 // GPIO port open drain configuration register bit
	#define UART_RX_CNPU    CNPUCbits.CNPUC15 // GPIO port pull-up resistor register bit
	#define UART_RX_CNPD    CNPDCbits.CNPDC15 // GPIO port pull-down resistor register bit
	#define UART_RX_CNEN0   CNEN0Cbits.CNEN0C15 // GPIO port change notification Enable register bit
	#define UART_RX_CNSTAT  CNSTATCbits.CNSTATC15 // GPIO port change notification Status register bit
	#define UART_RX_CNEN1   CNEN1Cbits.CNEN1C15 // GPIO port change notification Edge Select Enable register bit
	#define UART_RX_CNF     CNFCbits.CNFC15 // GPIO port change notification flag bit register bit
	#define UART_RX_RP      63 // Number of Remappable Pin
	#define UART_RX_SET     { asm volatile ("bset _LATC, #15 \n"); }
	#define UART_RX_CLEAR   { asm volatile ("bclr _LATC, #15 \n"); }
	#define UART_RX_TOGGLE  { asm volatile ("btg  _LATC, #15 \n"); }
	#define UART_RX_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define UART_RX_INIT_OUTPUT  {UART_RX_WR = PINSTATE_LOW; UART_RX_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define UART_RX_INIT_INPUT   {UART_RX_WR = PINSTATE_HIGH; UART_RX_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #5 is RC14
	#define UART_TX_TRIS    TRISCbits.TRISC14 // GPIO direction register bit
	#define UART_TX_WR      LATCbits.LATC14 // GPIO port latch register bit
	#define UART_TX_RD      PORTCbits.RC14 // GPIO port register bit
	#define UART_TX_ODC     ODCCbits.ODCC14 // GPIO port open drain configuration register bit
	#define UART_TX_CNPU    CNPUCbits.CNPUC14 // GPIO port pull-up resistor register bit
	#define UART_TX_CNPD    CNPDCbits.CNPDC14 // GPIO port pull-down resistor register bit
	#define UART_TX_CNEN0   CNEN0Cbits.CNEN0C14 // GPIO port change notification Enable register bit
	#define UART_TX_CNSTAT  CNSTATCbits.CNSTATC14 // GPIO port change notification Status register bit
	#define UART_TX_CNEN1   CNEN1Cbits.CNEN1C14 // GPIO port change notification Edge Select Enable register bit
	#define UART_TX_CNF     CNFCbits.CNFC14 // GPIO port change notification flag bit register bit
	#define UART_TX_RP      62 // Number of Remappable Pin
	#define UART_TX_SET     { asm volatile ("bset _LATC, #14 \n"); }
	#define UART_TX_CLEAR   { asm volatile ("bclr _LATC, #14 \n"); }
	#define UART_TX_TOGGLE  { asm volatile ("btg  _LATC, #14 \n"); }
	#define UART_TX_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define UART_TX_INIT_OUTPUT  {UART_TX_WR = PINSTATE_LOW; UART_TX_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define UART_TX_INIT_INPUT   {UART_TX_WR = PINSTATE_HIGH; UART_TX_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #28 is RB0
	#define DP28_TRIS    TRISBbits.TRISB0 // GPIO direction register bit
	#define DP28_WR      LATBbits.LATB0 // GPIO port latch register bit
	#define DP28_RD      PORTBbits.RB0 // GPIO port register bit
	#define DP28_ODC     ODCBbits.ODCB0 // GPIO port open drain configuration register bit
	#define DP28_CNPU    CNPUBbits.CNPUB0 // GPIO port pull-up resistor register bit
	#define DP28_CNPD    CNPDBbits.CNPDB0 // GPIO port pull-down resistor register bit
	#define DP28_CNEN0   CNEN0Bbits.CNEN0B0 // GPIO port change notification Enable register bit
	#define DP28_CNSTAT  CNSTATBbits.CNSTATB0 // GPIO port change notification Status register bit
	#define DP28_CNEN1   CNEN1Bbits.CNEN1B0 // GPIO port change notification Edge Select Enable register bit
	#define DP28_CNF     CNFBbits.CNFB0 // GPIO port change notification flag bit register bit
	#define DP28_RP      32 // Number of Remappable Pin
	#define DP28_SET     { asm volatile ("bset _LATB, #0 \n"); }
	#define DP28_CLEAR   { asm volatile ("bclr _LATB, #0 \n"); }
	#define DP28_TOGGLE  { asm volatile ("btg  _LATB, #0 \n"); }
	#define DP28_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define DP28_ANSEL   _ANSELB0 // analog/digital pin configuration register bit
	#define DP28_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define DP28_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define DP28_ADC_AN_INPUT 5   // ANx input pin number
	#define DP28_ADCBUF  ADCBUF5 // ADC buffer register for this input
	#define DP28_ADC_ANIE ADIELbits.IE5
	#define DP28_ADC_ANEIE ADEIELbits.EIEN5
	#define DP28_ADC_IF   _ADCAN5IF // interrupt flag bit
	#define DP28_ADC_IE   _ADCAN5IE // interrupt enable bit
	#define DP28_ADC_IP   _ADCAN5IP // interrupt priority for this analog input
	#define DP28_ADC_RDY  _AN5RDY // ADC buffer ready bit
	#define _DP28_ADC_Interrupt _ADCAN5Interrupt
	#define DP28_INIT_ANALOG	{DP28_ANSEL = 1; DP28_WR = PINSTATE_HIGH; DP28_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define DP28_INIT_OUTPUT  {DP28_WR = PINSTATE_LOW; DP28_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define DP28_INIT_INPUT   {DP28_WR = PINSTATE_HIGH; DP28_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #47 is RB7
	#define DP47_TRIS    TRISBbits.TRISB7 // GPIO direction register bit
	#define DP47_WR      LATBbits.LATB7 // GPIO port latch register bit
	#define DP47_RD      PORTBbits.RB7 // GPIO port register bit
	#define DP47_ODC     ODCBbits.ODCB7 // GPIO port open drain configuration register bit
	#define DP47_CNPU    CNPUBbits.CNPUB7 // GPIO port pull-up resistor register bit
	#define DP47_CNPD    CNPDBbits.CNPDB7 // GPIO port pull-down resistor register bit
	#define DP47_CNEN0   CNEN0Bbits.CNEN0B7 // GPIO port change notification Enable register bit
	#define DP47_CNSTAT  CNSTATBbits.CNSTATB7 // GPIO port change notification Status register bit
	#define DP47_CNEN1   CNEN1Bbits.CNEN1B7 // GPIO port change notification Edge Select Enable register bit
	#define DP47_CNF     CNFBbits.CNFB7 // GPIO port change notification flag bit register bit
	#define DP47_RP      39 // Number of Remappable Pin
	#define DP47_SET     { asm volatile ("bset _LATB, #7 \n"); }
	#define DP47_CLEAR   { asm volatile ("bclr _LATB, #7 \n"); }
	#define DP47_TOGGLE  { asm volatile ("btg  _LATB, #7 \n"); }
	#define DP47_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define DP47_ANSEL   _ANSELB7 // analog/digital pin configuration register bit
	#define DP47_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define DP47_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define DP47_ADC_AN_INPUT 9   // ANx input pin number
	#define DP47_ADCBUF  ADCBUF9 // ADC buffer register for this input
	#define DP47_ADC_ANIE ADIELbits.IE9
	#define DP47_ADC_ANEIE ADEIELbits.EIEN9
	#define DP47_ADC_IF   _ADCAN9IF // interrupt flag bit
	#define DP47_ADC_IE   _ADCAN9IE // interrupt enable bit
	#define DP47_ADC_IP   _ADCAN9IP // interrupt priority for this analog input
	#define DP47_ADC_RDY  _AN9RDY // ADC buffer ready bit
	#define _DP47_ADC_Interrupt _ADCAN9Interrupt
	#define DP47_INIT_ANALOG	{DP47_ANSEL = 1; DP47_WR = PINSTATE_HIGH; DP47_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define DP47_INIT_OUTPUT  {DP47_WR = PINSTATE_LOW; DP47_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define DP47_INIT_INPUT   {DP47_WR = PINSTATE_HIGH; DP47_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #48 is RB8
	#define DP48_TRIS    TRISBbits.TRISB8 // GPIO direction register bit
	#define DP48_WR      LATBbits.LATB8 // GPIO port latch register bit
	#define DP48_RD      PORTBbits.RB8 // GPIO port register bit
	#define DP48_ODC     ODCBbits.ODCB8 // GPIO port open drain configuration register bit
	#define DP48_CNPU    CNPUBbits.CNPUB8 // GPIO port pull-up resistor register bit
	#define DP48_CNPD    CNPDBbits.CNPDB8 // GPIO port pull-down resistor register bit
	#define DP48_CNEN0   CNEN0Bbits.CNEN0B8 // GPIO port change notification Enable register bit
	#define DP48_CNSTAT  CNSTATBbits.CNSTATB8 // GPIO port change notification Status register bit
	#define DP48_CNEN1   CNEN1Bbits.CNEN1B8 // GPIO port change notification Edge Select Enable register bit
	#define DP48_CNF     CNFBbits.CNFB8 // GPIO port change notification flag bit register bit
	#define DP48_RP      40 // Number of Remappable Pin
	#define DP48_SET     { asm volatile ("bset _LATB, #8 \n"); }
	#define DP48_CLEAR   { asm volatile ("bclr _LATB, #8 \n"); }
	#define DP48_TOGGLE  { asm volatile ("btg  _LATB, #8 \n"); }
	#define DP48_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define DP48_ANSEL   _ANSELB8 // analog/digital pin configuration register bit
	#define DP48_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define DP48_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define DP48_ADC_AN_INPUT 10   // ANx input pin number
	#define DP48_ADCBUF  ADCBUF10 // ADC buffer register for this input
	#define DP48_ADC_ANIE ADIELbits.IE10
	#define DP48_ADC_ANEIE ADEIELbits.EIEN10
	#define DP48_ADC_IF   _ADCAN10IF // interrupt flag bit
	#define DP48_ADC_IE   _ADCAN10IE // interrupt enable bit
	#define DP48_ADC_IP   _ADCAN10IP // interrupt priority for this analog input
	#define DP48_ADC_RDY  _AN10RDY // ADC buffer ready bit
	#define _DP48_ADC_Interrupt _ADCAN10Interrupt
	#define DP48_INIT_ANALOG	{DP48_ANSEL = 1; DP48_WR = PINSTATE_HIGH; DP48_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define DP48_INIT_OUTPUT  {DP48_WR = PINSTATE_LOW; DP48_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define DP48_INIT_INPUT   {DP48_WR = PINSTATE_HIGH; DP48_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #49 is RB9
	#define DP49_TRIS    TRISBbits.TRISB9 // GPIO direction register bit
	#define DP49_WR      LATBbits.LATB9 // GPIO port latch register bit
	#define DP49_RD      PORTBbits.RB9 // GPIO port register bit
	#define DP49_ODC     ODCBbits.ODCB9 // GPIO port open drain configuration register bit
	#define DP49_CNPU    CNPUBbits.CNPUB9 // GPIO port pull-up resistor register bit
	#define DP49_CNPD    CNPDBbits.CNPDB9 // GPIO port pull-down resistor register bit
	#define DP49_CNEN0   CNEN0Bbits.CNEN0B9 // GPIO port change notification Enable register bit
	#define DP49_CNSTAT  CNSTATBbits.CNSTATB9 // GPIO port change notification Status register bit
	#define DP49_CNEN1   CNEN1Bbits.CNEN1B9 // GPIO port change notification Edge Select Enable register bit
	#define DP49_CNF     CNFBbits.CNFB9 // GPIO port change notification flag bit register bit
	#define DP49_RP      41 // Number of Remappable Pin
	#define DP49_SET     { asm volatile ("bset _LATB, #9 \n"); }
	#define DP49_CLEAR   { asm volatile ("bclr _LATB, #9 \n"); }
	#define DP49_TOGGLE  { asm volatile ("btg  _LATB, #9 \n"); }
	#define DP49_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define DP49_ANSEL   _ANSELB9 // analog/digital pin configuration register bit
	#define DP49_ADCCORE 0 // index starts from zero, last index indicated shared adC core
	#define DP49_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define DP49_ADC_AN_INPUT 11   // ANx input pin number
	#define DP49_ADCBUF  ADCBUF11 // ADC buffer register for this input
	#define DP49_ADC_ANIE ADIELbits.IE11
	#define DP49_ADC_ANEIE ADEIELbits.EIEN11
	#define DP49_ADC_IF   _ADCAN11IF // interrupt flag bit
	#define DP49_ADC_IE   _ADCAN11IE // interrupt enable bit
	#define DP49_ADC_IP   _ADCAN11IP // interrupt priority for this analog input
	#define DP49_ADC_RDY  _AN11RDY // ADC buffer ready bit
	#define _DP49_ADC_Interrupt _ADCAN11Interrupt
	#define DP49_INIT_ANALOG	{DP49_ANSEL = 1; DP49_WR = PINSTATE_HIGH; DP49_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define DP49_INIT_OUTPUT  {DP49_WR = PINSTATE_LOW; DP49_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define DP49_INIT_INPUT   {DP49_WR = PINSTATE_HIGH; DP49_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
#elif defined (__P33SMPS_CH_SLV1__)

// Device Pin #16 is RA2
	#define ECP11_TRIS    TRISAbits.TRISA2 // GPIO direction register bit
	#define ECP11_WR      LATAbits.LATA2 // GPIO port latch register bit
	#define ECP11_RD      PORTAbits.RA2 // GPIO port register bit
	#define ECP11_ODC     ODCAbits.ODCA2 // GPIO port open drain configuration register bit
	#define ECP11_CNPU    CNPUAbits.CNPUA2 // GPIO port pull-up resistor register bit
	#define ECP11_CNPD    CNPDAbits.CNPDA2 // GPIO port pull-down resistor register bit
	#define ECP11_CNEN0   CNEN0Abits.CNEN0A2 // GPIO port change notification Enable register bit
	#define ECP11_CNSTAT  CNSTATAbits.CNSTATA2 // GPIO port change notification Status register bit
	#define ECP11_CNEN1   CNEN1Abits.CNEN1A2 // GPIO port change notification Edge Select Enable register bit
	#define ECP11_CNF     CNFAbits.CNFA2 // GPIO port change notification flag bit register bit
	#define ECP11_SET     { asm volatile ("bset _LATA, #2 \n"); }
	#define ECP11_CLEAR   { asm volatile ("bclr _LATA, #2 \n"); }
	#define ECP11_TOGGLE  { asm volatile ("btg  _LATA, #2 \n"); }
	#define ECP11_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
	#define ECP11_ANSEL   _ANSELA2 // analog/digital pin configuration register bit
	#define ECP11_ADCCORE 2 // index starts from zero, last index indicated shared adC core
	#define ECP11_IS_SHARED_CORE true // AN input is routed to a dedicated or shared ACD core
	#define ECP11_ADC_AN_INPUT 16   // ANx input pin number
	#define ECP11_ADCBUF  ADCBUF16 // ADC buffer register for this input
	#define ECP11_ADC_ANIE ADIEHbits.IE16
	#define ECP11_ADC_ANEIE ADEIEHbits.EIEN16
	#define ECP11_ADC_IF   _ADCAN16IF // interrupt flag bit
	#define ECP11_ADC_IE   _ADCAN16IE // interrupt enable bit
	#define ECP11_ADC_IP   _ADCAN16IP // interrupt priority for this analog input
	#define ECP11_ADC_RDY  _AN16RDY // ADC buffer ready bit
	#define _ECP11_ADC_Interrupt _ADCAN16Interrupt
	#define ECP11_INIT_ANALOG	{ECP11_ANSEL = 1; ECP11_WR = PINSTATE_HIGH; ECP11_TRIS = PINDIR_INPUT;} // initialization macro for analog input
	#define ECP11_INIT_OUTPUT  {ECP11_WR = PINSTATE_LOW; ECP11_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP11_INIT_INPUT   {ECP11_WR = PINSTATE_HIGH; ECP11_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	
// Device Pin #14 is RA0
	#define ECP15_TRIS    TRISAbits.TRISA0 // GPIO direction register bit
	#define ECP15_WR      LATAbits.LATA0 // GPIO port latch register bit
	#define ECP15_RD      PORTAbits.RA0 // GPIO port register bit
	#define ECP15_ODC     ODCAbits.ODCA0 // GPIO port open drain configuration register bit
	#define ECP15_CNPU    CNPUAbits.CNPUA0 // GPIO port pull-up resistor register bit
	#define ECP15_CNPD    CNPDAbits.CNPDA0 // GPIO port pull-down resistor register bit
	#define ECP15_CNEN0   CNEN0Abits.CNEN0A0 // GPIO port change notification Enable register bit
	#define ECP15_CNSTAT  CNSTATAbits.CNSTATA0 // GPIO port change notification Status register bit
	#define ECP15_CNEN1   CNEN1Abits.CNEN1A0 // GPIO port change notification Edge Select Enable register bit
	#define ECP15_CNF     CNFAbits.CNFA0 // GPIO port change notification flag bit register bit
	#define ECP15_SET     { asm volatile ("bset _LATA, #0 \n"); }
	#define ECP15_CLEAR   { asm volatile ("bclr _LATA, #0 \n"); }
	#define ECP15_TOGGLE  { asm volatile ("btg  _LATA, #0 \n"); }
	#define ECP15_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
	#define ECP15_INIT_OUTPUT  {ECP15_WR = PINSTATE_LOW; ECP15_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
	#define ECP15_INIT_INPUT   {ECP15_WR = PINSTATE_HIGH; ECP15_TRIS = PINDIR_INPUT;} // initialization macro for digital input
	


#endif


#endif	/* __10889_P33CH_R10_PINMAP_H__ */
